pmmarquez/arduino-pico-controllino_neo/boards.txt
controllino_neo_core.menu.uploadmethod.picotool.upload.tool=picotool
controllino_neo_core.menu.uploadmethod.picotool.upload.tool.default=picotool
controllino_neo_core.menu.uploadmethod.picoprobe=Picoprobe
controllino_neo_core.menu.uploadmethod.picoprobe.build.ram_length=256k
controllino_neo_core.menu.uploadmethod.picoprobe.build.debugscript=picoprobe.tcl
controllino_neo_core.menu.uploadmethod.picoprobe.upload.maximum_data_size=262144
controllino_neo_core.menu.uploadmethod.picoprobe.upload.tool=picoprobe
controllino_neo_core.menu.uploadmethod.picoprobe.upload.tool.default=picoprobe
controllino_neo_core.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
controllino_neo_core.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
controllino_neo_core.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
controllino_neo_core.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
controllino_neo_core.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
controllino_neo_core.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
controllino_neo_core.menu.uploadmethod.picodebug=Pico-Debug
controllino_neo_core.menu.uploadmethod.picodebug.build.ram_length=240k
controllino_neo_core.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
controllino_neo_core.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
controllino_neo_core.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
controllino_neo_core.menu.uploadmethod.picodebug.upload.tool=picodebug
controllino_neo_core.menu.uploadmethod.picodebug.upload.tool.default=picodebug
